Res-hotel/Res-firecracker-set-v1/firecracker_t_10_c_30_frontVcpu_1_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4982.734ms, rate sampling interval: 17645ms
  Thread calibration: mean lat.: 5034.860ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 5012.647ms, rate sampling interval: 17793ms
  Thread calibration: mean lat.: 4994.505ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 4953.654ms, rate sampling interval: 17596ms
  Thread calibration: mean lat.: 4375.961ms, rate sampling interval: 16752ms
  Thread calibration: mean lat.: 4970.004ms, rate sampling interval: 17612ms
  Thread calibration: mean lat.: 4928.900ms, rate sampling interval: 17612ms
  Thread calibration: mean lat.: 5003.357ms, rate sampling interval: 17776ms
  Thread calibration: mean lat.: 4813.959ms, rate sampling interval: 17367ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.00s    15.03s    0.96m    58.77%
    Req/Sec   209.70      1.45   212.00     90.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.01s 
 75.000%   43.65s 
 90.000%    0.87m 
 99.000%    0.96m 
 99.900%    0.97m 
 99.990%    0.98m 
 99.999%    0.98m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.015     0.000000            1         1.00
   11386.879     0.100000        10497         1.11
   15671.295     0.200000        20979         1.25
   20889.599     0.300000        31467         1.43
   26034.175     0.400000        41949         1.67
   31014.911     0.500000        52462         2.00
   33259.519     0.550000        57698         2.22
   35717.119     0.600000        62967         2.50
   38305.791     0.650000        68231         2.86
   40861.695     0.700000        73440         3.33
   43646.975     0.750000        78663         4.00
   45023.231     0.775000        81310         4.44
   46366.719     0.800000        83926         5.00
   47742.975     0.825000        86557         5.71
   49119.231     0.850000        89204         6.67
   50528.255     0.875000        91767         8.00
   51281.919     0.887500        93084         8.89
   52002.815     0.900000        94387        10.00
   52690.943     0.912500        95695        11.43
   53444.607     0.925000        97032        13.33
   54099.967     0.937500        98317        16.00
   54460.415     0.943750        99009        17.78
   54820.863     0.950000        99660        20.00
   55181.311     0.956250       100335        22.86
   55541.759     0.962500       100957        26.67
   55934.975     0.968750       101631        32.00
   56131.583     0.971875       101961        35.56
   56328.191     0.975000       102301        40.00
   56524.799     0.978125       102622        45.71
   56721.407     0.981250       102938        53.33
   56950.783     0.984375       103256        64.00
   57081.855     0.985938       103428        71.11
   57212.927     0.987500       103593        80.00
   57311.231     0.989062       103725        91.43
   57442.303     0.990625       103907       106.67
   57573.375     0.992188       104077       128.00
   57638.911     0.992969       104147       142.22
   57704.447     0.993750       104217       160.00
   57802.751     0.994531       104310       182.86
   57901.055     0.995313       104397       213.33
   57999.359     0.996094       104472       256.00
   58064.895     0.996484       104527       284.44
   58097.663     0.996875       104557       320.00
   58163.199     0.997266       104612       365.71
   58195.967     0.997656       104635       426.67
   58261.503     0.998047       104679       512.00
   58294.271     0.998242       104694       568.89
   58327.039     0.998437       104712       640.00
   58392.575     0.998633       104742       731.43
   58425.343     0.998828       104758       853.33
   58490.879     0.999023       104780      1024.00
   58490.879     0.999121       104780      1137.78
   58523.647     0.999219       104793      1280.00
   58556.415     0.999316       104805      1462.86
   58589.183     0.999414       104818      1706.67
   58621.951     0.999512       104827      2048.00
   58621.951     0.999561       104827      2275.56
   58654.719     0.999609       104838      2560.00
   58654.719     0.999658       104838      2925.71
   58687.487     0.999707       104848      3413.33
   58687.487     0.999756       104848      4096.00
   58687.487     0.999780       104848      4551.11
   58720.255     0.999805       104861      5120.00
   58720.255     0.999829       104861      5851.43
   58720.255     0.999854       104861      6826.67
   58720.255     0.999878       104861      8192.00
   58720.255     0.999890       104861      9102.22
   58720.255     0.999902       104861     10240.00
   58753.023     0.999915       104870     11702.86
   58753.023     0.999927       104870     13653.33
   58753.023     0.999939       104870     16384.00
   58753.023     0.999945       104870     18204.44
   58753.023     0.999951       104870     20480.00
   58753.023     0.999957       104870     23405.71
   58753.023     0.999963       104870     27306.67
   58753.023     0.999969       104870     32768.00
   58753.023     0.999973       104870     36408.89
   58753.023     0.999976       104870     40960.00
   58753.023     0.999979       104870     46811.43
   58753.023     0.999982       104870     54613.33
   58753.023     0.999985       104870     65536.00
   58753.023     0.999986       104870     72817.78
   58753.023     0.999988       104870     81920.00
   58753.023     0.999989       104870     93622.86
   58785.791     0.999991       104871    109226.67
   58785.791     1.000000       104871          inf
#[Mean    =    31000.648, StdDeviation   =    15031.577]
#[Max     =    58753.024, Total count    =       104871]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  125282 requests in 1.00m, 52.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 91
Requests/sec:   2087.77
Transfer/sec:      0.87MB